arduino/ArduinoCore-samd/boards.txt
# MattairTech MT-D11 (no bootloader)
mattairtech_mt_d11_bl0k.name=MattairTech MT-D11 (no bootloader)
mattairtech_mt_d11_bl0k.vid.0=0x16D0
mattairtech_mt_d11_bl0k.pid.0=0x0557
mattairtech_mt_d11_bl0k.vid.1=0x16D0
mattairtech_mt_d11_bl0k.pid.1=0x0856
mattairtech_mt_d11_bl0k.upload.tool=arduino:openocd
mattairtech_mt_d11_bl0k.upload.protocol=sam-ba
mattairtech_mt_d11_bl0k.upload.use_1200bps_touch=false
mattairtech_mt_d11_bl0k.upload.wait_for_upload_port=false
mattairtech_mt_d11_bl0k.upload.native_usb=false
mattairtech_mt_d11_bl0k.upload.maximum_size=16384
mattairtech_mt_d11_bl0k.build.extra_flags=-D__SAMD11D14AM__ -D__NO_BOOTLOADER__ {build.usb_flags}
mattairtech_mt_d11_bl0k.build.ldscript=linker_scripts/gcc/SAMD11D14AM_without_bootloader.ld
mattairtech_mt_d11_bl0k.build.openocdscript=openocd_scripts/SAMD11D14AM.cfg
mattairtech_mt_d11_bl0k.build.mcu=cortex-m0plus
mattairtech_mt_d11_bl0k.build.f_cpu=48000000L
mattairtech_mt_d11_bl0k.build.usb_product="MT-D11"
mattairtech_mt_d11_bl0k.build.usb_manufacturer="MattairTech"
mattairtech_mt_d11_bl0k.build.board=CDC_UART
mattairtech_mt_d11_bl0k.menu.com.cdc_uart=CDC_UART
mattairtech_mt_d11_bl0k.menu.com.cdc_uart.build.board=CDC_UART
mattairtech_mt_d11_bl0k.menu.com.cdc_uart.build.pid=0x0557
mattairtech_mt_d11_bl0k.menu.com.cdc_hid_uart=CDC_HID_UART
mattairtech_mt_d11_bl0k.menu.com.cdc_hid_uart.build.board=CDC_HID_UART
mattairtech_mt_d11_bl0k.menu.com.cdc_hid_uart.build.pid=0x0856
mattairtech_mt_d11_bl0k.menu.com.cdc_hid=CDC_HID
mattairtech_mt_d11_bl0k.menu.com.cdc_hid.build.board=CDC_HID
mattairtech_mt_d11_bl0k.menu.com.cdc_hid.build.pid=0x0856
mattairtech_mt_d11_bl0k.menu.com.cdc=CDC_ONLY
mattairtech_mt_d11_bl0k.menu.com.cdc.build.board=CDC_ONLY
mattairtech_mt_d11_bl0k.menu.com.cdc.build.pid=0x0557
mattairtech_mt_d11_bl0k.menu.com.cdc_midi_hid_uart=CDC_MIDI_HID_UART
mattairtech_mt_d11_bl0k.menu.com.cdc_midi_hid_uart.build.board=CDC_MIDI_HID_UART
mattairtech_mt_d11_bl0k.menu.com.cdc_midi_hid_uart.build.pid=0x0B34
# mattairtech_mt_d11_bl0k.menu.com.cdc_msd_hid_uart=CDC_MSD_HID_UART
# mattairtech_mt_d11_bl0k.menu.com.cdc_msd_hid_uart.build.board=CDC_MSD_HID_UART
# mattairtech_mt_d11_bl0k.menu.com.cdc_msd_hid_uart.build.pid=0x0B40
# mattairtech_mt_d11_bl0k.menu.com.cdc_msd_midi_hid_uart=CDC_MSD_MIDI_HID_UART
# mattairtech_mt_d11_bl0k.menu.com.cdc_msd_midi_hid_uart.build.board=CDC_MSD_MIDI_HID_UART
# mattairtech_mt_d11_bl0k.menu.com.cdc_msd_midi_hid_uart.build.pid=0x0B41
# mattairtech_mt_d11_bl0k.menu.com.msd_uart=MSD_UART
# mattairtech_mt_d11_bl0k.menu.com.msd_uart.build.board=MSD_UART
# mattairtech_mt_d11_bl0k.menu.com.msd_uart.build.pid=0x0A0C
mattairtech_mt_d11_bl0k.menu.com.uart=UART_ONLY
mattairtech_mt_d11_bl0k.menu.com.uart.build.board=UART_ONLY
mattairtech_mt_d11_bl0k.menu.com.uart.build.pid=0x0856
mattairtech_mt_d11_bl0k.menu.com.none=USB_UART_DISABLED
mattairtech_mt_d11_bl0k.menu.com.none.build.board=USB_UART_DISABLED
mattairtech_mt_d11_bl0k.menu.com.none.build.pid=0x0856
mattairtech_mt_d11_bl0k.build.core=arduino
mattairtech_mt_d11_bl0k.build.variant=MT_D11
mattairtech_mt_d11_bl0k.build.variant_system_lib=
mattairtech_mt_d11_bl0k.build.vid=0x16D0
mattairtech_mt_d11_bl0k.build.pid=0x0856


# MattairTech Core for Arduino Zero (8KB bootloader, Native USB Port)
arduino_zero_native.name=Arduino Zero (Native USB Port)
arduino_zero_native.vid.0=0x2341
arduino_zero_native.pid.0=0x804d
arduino_zero_native.vid.1=0x2341
arduino_zero_native.pid.1=0x004d
arduino_zero_native.upload.tool=MattairTech_Arduino:bossac
arduino_zero_native.upload.protocol=sam-ba
arduino_zero_native.upload.maximum_size=262144
arduino_zero_native.upload.use_1200bps_touch=true
arduino_zero_native.upload.wait_for_upload_port=true
arduino_zero_native.upload.native_usb=true
arduino_zero_native.build.mcu=cortex-m0plus
arduino_zero_native.build.f_cpu=48000000L
arduino_zero_native.build.usb_product="Arduino Zero"
arduino_zero_native.build.usb_manufacturer="Arduino LLC"
arduino_zero_native.build.board=SAMD_ZERO
arduino_zero_native.menu.com.cdc_uart=CDC_UART
arduino_zero_native.menu.com.cdc_uart.build.board=CDC_UART
arduino_zero_native.menu.com.cdc_hid_uart=CDC_HID_UART
arduino_zero_native.menu.com.cdc_hid_uart.build.board=CDC_HID_UART
arduino_zero_native.menu.com.cdc_hid=CDC_HID
arduino_zero_native.menu.com.cdc_hid.build.board=CDC_HID
arduino_zero_native.menu.com.cdc=CDC_ONLY
arduino_zero_native.menu.com.cdc.build.board=CDC_ONLY
arduino_zero_native.menu.com.cdc_midi_hid_uart=CDC_MIDI_HID_UART
arduino_zero_native.menu.com.cdc_midi_hid_uart.build.board=CDC_MIDI_HID_UART
# arduino_zero_native.menu.com.cdc_msd_hid_uart=CDC_MSD_HID_UART
# arduino_zero_native.menu.com.cdc_msd_hid_uart.build.board=CDC_MSD_HID_UART
# arduino_zero_native.menu.com.cdc_msd_midi_hid_uart=CDC_MSD_MIDI_HID_UART
# arduino_zero_native.menu.com.cdc_msd_midi_hid_uart.build.board=CDC_MSD_MIDI_HID_UART
# arduino_zero_native.menu.com.msd_uart=MSD_UART
# arduino_zero_native.menu.com.msd_uart.build.board=MSD_UART
arduino_zero_native.menu.com.uart=UART_ONLY
arduino_zero_native.menu.com.uart.build.board=UART_ONLY
arduino_zero_native.menu.com.none=USB_UART_DISABLED
arduino_zero_native.menu.com.none.build.board=USB_UART_DISABLED
arduino_zero_native.build.core=arduino
arduino_zero_native.build.extra_flags=-D__SAMD21G18A__ -D__8KB_BOOTLOADER__ {build.usb_flags}
arduino_zero_native.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
arduino_zero_native.build.openocdscript=openocd_scripts/arduino_zero.cfg
arduino_zero_native.build.variant=arduino_zero
arduino_zero_native.build.variant_system_lib=
arduino_zero_native.build.vid=0x2341
arduino_zero_native.build.pid=0x804d

# MattairTech Core for Arduino Zero (8KB bootloader, Programming Port)
#arduino_zero_edbg.name=Arduino Zero (Programming Port)
#arduino_zero_edbg.vid.0=0x03eb
#arduino_zero_edbg.pid.0=0x2157
#arduino_zero_edbg.upload.tool=arduino:openocd
#arduino_zero_edbg.upload.protocol=sam-ba
#arduino_zero_edbg.upload.maximum_size=262144
#arduino_zero_edbg.upload.use_1200bps_touch=false
#arduino_zero_edbg.upload.wait_for_upload_port=false
#arduino_zero_edbg.upload.native_usb=false
#arduino_zero_edbg.build.mcu=cortex-m0plus
#arduino_zero_edbg.build.f_cpu=48000000L
#arduino_zero_edbg.build.usb_product="Arduino Zero"
#arduino_zero_edbg.build.usb_manufacturer="Arduino LLC"
#arduino_zero_edbg.build.board=SAMD_ZERO
#arduino_zero_edbg.menu.com.cdc_uart=CDC_UART
#arduino_zero_edbg.menu.com.cdc_uart.build.board=CDC_UART
#arduino_zero_edbg.menu.com.cdc_hid_uart=CDC_HID_UART
#arduino_zero_edbg.menu.com.cdc_hid_uart.build.board=CDC_HID_UART
#arduino_zero_edbg.menu.com.cdc_hid=CDC_HID
#arduino_zero_edbg.menu.com.cdc_hid.build.board=CDC_HID
#arduino_zero_edbg.menu.com.cdc=CDC_ONLY
#arduino_zero_edbg.menu.com.cdc.build.board=CDC_ONLY
#arduino_zero_edbg.menu.com.cdc_midi_hid_uart=CDC_MIDI_HID_UART
#arduino_zero_edbg.menu.com.cdc_midi_hid_uart.build.board=CDC_MIDI_HID_UART
# arduino_zero_edbg.menu.com.cdc_msd_hid_uart=CDC_MSD_HID_UART
# arduino_zero_edbg.menu.com.cdc_msd_hid_uart.build.board=CDC_MSD_HID_UART
# arduino_zero_edbg.menu.com.cdc_msd_midi_hid_uart=CDC_MSD_MIDI_HID_UART
# arduino_zero_edbg.menu.com.cdc_msd_midi_hid_uart.build.board=CDC_MSD_MIDI_HID_UART
# arduino_zero_edbg.menu.com.msd_uart=MSD_UART
# arduino_zero_edbg.menu.com.msd_uart.build.board=MSD_UART
#arduino_zero_edbg.menu.com.uart=UART_ONLY
#arduino_zero_edbg.menu.com.uart.build.board=UART_ONLY
#arduino_zero_edbg.menu.com.none=USB_UART_DISABLED
#arduino_zero_edbg.menu.com.none.build.board=USB_UART_DISABLED
#arduino_zero_edbg.build.core=arduino
#arduino_zero_edbg.build.extra_flags=-D__SAMD21G18A__ -D__8KB_BOOTLOADER__ {build.usb_flags}
#arduino_zero_edbg.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
#arduino_zero_edbg.build.openocdscript=openocd_scripts/arduino_zero.cfg
#arduino_zero_edbg.build.variant=arduino_zero
#arduino_zero_edbg.build.variant_system_lib=
#arduino_zero_edbg.build.vid=0x2341
#arduino_zero_edbg.build.pid=0x804d
#arduino_zero_edbg.bootloader.tool=arduino:openocd
#arduino_zero_edbg.bootloader.file=zero/binaries/sam_m0p_sam_ba_SAMD21E18A.bin
